local define_open_act_reward = {
	["1"] = {
		["act_id"] = "1",
		["condition1"] = 10,
		["gold"] = 0,
		["item"] = "3016:10",
		["desc"] = "累计充值10钻，赠英雄碎片“主母”",

	},
	["2"] = {
		["act_id"] = "1",
		["condition1"] = 100,
		["gold"] = 0,
		["item"] = "3016:10",
		["desc"] = "累计充值100钻，赠英雄碎片“主母”",

	},
	["3"] = {
		["act_id"] = "1",
		["condition1"] = 500,
		["gold"] = 0,
		["item"] = "3016:10",
		["desc"] = "累计充值500钻，赠英雄碎片“主母”",

	},
	["4"] = {
		["act_id"] = "1",
		["condition1"] = 1000,
		["gold"] = 0,
		["item"] = "3016:10",
		["desc"] = "累计充值1000钻，赠英雄碎片“主母”",

	},
	["5"] = {
		["act_id"] = "1",
		["condition1"] = 2500,
		["gold"] = 0,
		["item"] = "3016:10",
		["desc"] = "累计充值2500钻，赠英雄碎片“主母”",

	},
	["6"] = {
		["act_id"] = "1",
		["condition1"] = 3000,
		["gold"] = 0,
		["item"] = "3016:10",
		["desc"] = "累计充值3000钻，赠英雄碎片“主母”",

	},
	["7"] = {
		["act_id"] = "1",
		["condition1"] = 3500,
		["gold"] = 0,
		["item"] = "3016:10",
		["desc"] = ""累计充值3500钻，赠英雄碎片“主母”",

	},
	["8"] = {
		["act_id"] = "1",
		["condition1"] = 4000,
		["gold"] = 0,
		["item"] = "3016:10",
		["desc"] = "累计充值4000钻，赠英雄碎片“主母”",

	},
	["9"] = {
		["act_id"] = "1",
		["condition1"] = 4500,
		["gold"] = 0,
		["item"] = "3016:10",
		["desc"] = "累计充值4500钻，赠英雄碎片“主母”",

	},
	["10"] = {
		["act_id"] = "1",
		["condition1"] = 5000,
		["gold"] = 0,
		["item"] = "3016:20",
		["desc"] = "累计充值5000钻，赠英雄碎片“主母”",

	},
	["11"] = {
		["act_id"] = 2,
		["condition1"] = 1,
		["gold"] = 0,
		["item"] = "82:2,85:2,88:2,91:2",
		["desc"] = "累计充值排名第1（充值50000钻以上可参加排名）",

	},
	["12"] = {
		["act_id"] = 2,
		["condition1"] = 2,
		["gold"] = 0,
		["item"] = "81:2,84:2,87:2,90:2",
		["desc"] = "累计充值排名第2（充值50000钻以上可参加排名）",

	},
	["13"] = {
		["act_id"] = 2,
		["condition1"] = 3,
		["gold"] = 0,
		["item"] = "80:2,83:2,86:2,89:2",
		["desc"] = "累计充值排名第3（充值50000钻以上可参加排名）",

	},
	["14"] = {
		["act_id"] = 3,
		["condition1"] = 10000,
		["gold"] = 0,
		["item"] = "1000:10,1020:10",
		["desc"] = "累计消费10000钻",

	},
	["15"] = {
		["act_id"] = 3,
		["condition1"] = 20000,
		["gold"] = 0,
		["item"] = "1000:30,1020:30,1001:10,1021:10",
		["desc"] = "累计消费20000钻",

	},
	["16"] = {
		["act_id"] = 3,
		["condition1"] = 30000,
		["gold"] = 0,
		["item"] = "1000:30,1020:30,1001:25,1021:20",
		["desc"] = "累计消费30000钻",

	},
	["17"] = {
		["act_id"] = 3,
		["condition1"] = 40000,
		["gold"] = 0,
		["item"] = "1001:20,1021:20,1002:15,1022:10",
		["desc"] = "累计消费40000钻",

	},
	["18"] = {
		["act_id"] = 3,
		["condition1"] = 50000,
		["gold"] = 0,
		["item"] = "1001:30,1021:30,1002:30,1022:20",
		["desc"] = "累计消费50000钻",

	},
	["19"] = {
		["act_id"] = 4,
		["condition1"] = 500,
		["gold"] = 50,
		["item"] = "",
		["desc"] = "累计充值500钻及以上，即可领取50钻",

	},
	["20"] = {
		["act_id"] = 4,
		["condition1"] = 1000,
		["gold"] = 100,
		["item"] = "",
		["desc"] = "累计充值1000钻及以上，即可领取100钻",

	},
	["21"] = {
		["act_id"] = 4,
		["condition1"] = 1500,
		["gold"] = 150,
		["item"] = "",
		["desc"] = "累计充值1500钻及以上，即可领取150钻",

	},
	["22"] = {
		["act_id"] = 4,
		["condition1"] = 2000,
		["gold"] = 200,
		["item"] = "",
		["desc"] = "累计充值2000钻及以上，即可领取200钻",

	},
	["23"] = {
		["act_id"] = 4,
		["condition1"] = 2500,
		["gold"] = 250,
		["item"] = "",
		["desc"] = "累计充值2500钻及以上，即可领取250钻",

	},
	["24"] = {
		["act_id"] = 4,
		["condition1"] = 3000,
		["gold"] = 300,
		["item"] = "",
		["desc"] = "累计充值3000钻及以上，即可领取300钻",

	},
	["25"] = {
		["act_id"] = 4,
		["condition1"] = 3500,
		["gold"] = 350,
		["item"] = "",
		["desc"] = "累计充值3500钻及以上，即可领取350钻",

	},
	["26"] = {
		["act_id"] = 4,
		["condition1"] = 4000,
		["gold"] = 400,
		["item"] = "",
		["desc"] = "累计充值4000钻及以上，即可领取400钻",

	},
	["27"] = {
		["act_id"] = 4,
		["condition1"] = 4500,
		["gold"] = 450,
		["item"] = "",
		["desc"] = "累计充值4500钻及以上，即可领取450钻",

	},
	["28"] = {
		["act_id"] = 4,
		["condition1"] = 5000,
		["gold"] = 500,
		["item"] = "",
		["desc"] = "累计充值5000钻及以上，即可领取500钻",

	},
	["29"] = {
		["act_id"] = 5,
		["condition1"] = 1,
		["gold"] = 0,
		["item"] = "3001:30",
		["desc"] = "活动结束时，竞技场防守战力排名第1",

	},
	["30"] = {
		["act_id"] = 5,
		["condition1"] = 2,
		["gold"] = 0,
		["item"] = "3001:31",
		["desc"] = "活动结束时，竞技场防守战力排名第2",

	},
	["31"] = {
		["act_id"] = 5,
		["condition1"] = 3,
		["gold"] = 0,
		["item"] = "3001:32",
		["desc"] = "活动结束时，竞技场防守战力排名第3",

	},
	["32"] = {
		["act_id"] = 6,
		["condition1"] = 1000,
		["gold"] = 0,
		["item"] = "3001:3",
		["desc"] = "活动期间，竞技场排名在1000名以内",

	},
	["33"] = {
		["act_id"] = 6,
		["condition1"] = 500,
		["gold"] = 0,
		["item"] = "3001:4",
		["desc"] = "活动期间，竞技场排名在500名以内",

	},
	["34"] = {
		["act_id"] = 6,
		["condition1"] = 300,
		["gold"] = 0,
		["item"] = "3001:5",
		["desc"] = "活动期间，竞技场排名在300名以内",

	},
	["35"] = {
		["act_id"] = 6,
		["condition1"] = 200,
		["gold"] = 0,
		["item"] = "3001:6",
		["desc"] = "活动期间，竞技场排名在200名以内",

	},
	["36"] = {
		["act_id"] = 6,
		["condition1"] = 100,
		["gold"] = 0,
		["item"] = "3001:7",
		["desc"] = "活动期间，竞技场排名在100名以内",

	},
	["37"] = {
		["act_id"] = 6,
		["condition1"] = 50,
		["gold"] = 0,
		["item"] = "3001:8",
		["desc"] = "活动期间，竞技场排名在50名以内",

	},
	["38"] = {
		["act_id"] = 6,
		["condition1"] = 10,
		["gold"] = 0,
		["item"] = "3001:9",
		["desc"] = "活动期间，竞技场排名在10名以内",

	},
	["39"] = {
		["act_id"] = 6,
		["condition1"] = 3,
		["gold"] = 0,
		["item"] = "3001:10",
		["desc"] = "活动期间，竞技场排名在3名以内",

	},
	["40"] = {
		["act_id"] = 7,
		["condition1"] = 1,
		["gold"] = 0,
		["item"] = "3002:10",
		["desc"] = "活动结束时，竞技场排名第1",

	},
	["41"] = {
		["act_id"] = 7,
		["condition1"] = 2,
		["gold"] = 0,
		["item"] = "3003:10",
		["desc"] = "活动结束时，竞技场排名第2",

	},
	["42"] = {
		["act_id"] = 7,
		["condition1"] = 3,
		["gold"] = 0,
		["item"] = "3004:10",
		["desc"] = "活动结束时，竞技场排名第3",

	},
	["43"] = {
		["act_id"] = 8,
		["condition1"] = 20,
		["gold"] = 0,
		["item"] = "1000:30,1020:30,1001:10,1021:10",
		["desc"] = "活动期间，战队等级达到20级",

	},
	["44"] = {
		["act_id"] = 8,
		["condition1"] = 25,
		["gold"] = 0,
		["item"] = "1000:30,1020:30,1001:15,1021:15",
		["desc"] = "活动期间，战队等级达到25级",

	},
	["45"] = {
		["act_id"] = 8,
		["condition1"] = 30,
		["gold"] = 0,
		["item"] = "1000:30,1020:30,1001:25,1021:20",
		["desc"] = "活动期间，战队等级达到30级",

	},
	["46"] = {
		["act_id"] = 8,
		["condition1"] = 35,
		["gold"] = 0,
		["item"] = "1001:20,1021:20,1002:15,1022:10",
		["desc"] = "活动期间，战队等级达到35级",

	},
	["47"] = {
		["act_id"] = 8,
		["condition1"] = 40,
		["gold"] = 0,
		["item"] = "1001:30,1021:30,1002:30,1022:20",
		["desc"] = "活动期间，战队等级达到40级",

	},
	["48"] = {
		["act_id"] = 9,
		["condition1"] = 1,
		["gold"] = 0,
		["item"] = "3005:25",
		["desc"] = "活动结束时，战队等级排名第1",

	},
	["49"] = {
		["act_id"] = 9,
		["condition1"] = 2,
		["gold"] = 0,
		["item"] = "3005:15",
		["desc"] = "活动结束时，战队等级排名第2",

	},
	["50"] = {
		["act_id"] = 9,
		["condition1"] = 3,
		["gold"] = 0,
		["item"] = "3005:10",
		["desc"] = "活动结束时，战队等级排名第3",

	},
	["51"] = {
		["act_id"] = 10,
		["condition1"] = 5,
		["gold"] = 0,
		["item"] = "3006:25",
		["desc"] = "活动期间，所在公会等级达到5级",

	},
	["52"] = {
		["act_id"] = 10,
		["condition1"] = 4,
		["gold"] = 0,
		["item"] = "3006:15",
		["desc"] = "活动期间，所在公会等级达到4级",

	},
	["53"] = {
		["act_id"] = 10,
		["condition1"] = 3,
		["gold"] = 0,
		["item"] = "3006:10",
		["desc"] = "活动期间，所在公会等级达到3级",

	},

}
return define_open_act_reward
