local juexing_skill = {
	["1"] = {
		["name"] = "雷神之锤",
		["icon"] = 5000,
		["dic"] = "各种战车及小怪召唤阵，处于磁暴状态。该状态下无法发动攻击。",
		["cd"] = 8,
		["lv_num"] = 2,
		["hero_id"] = "11;29",

	},
	["2"] = {
		["name"] = "火炮轰炸",
		["icon"] = 5001,
		["dic"] = "轰炸距离最近的敌方战车、召唤阵等。对敌方英雄无效。",
		["cd"] = 10,
		["lv_num"] = 2,
		["hero_id"] = "5;18",

	},
	["3"] = {
		["name"] = "召唤箭塔车",
		["icon"] = 5002,
		["dic"] = "攻击最远处的一个敌方英雄。",
		["cd"] = 10,
		["lv_num"] = 2,
		["hero_id"] = "9;19",

	},
	["4"] = {
		["name"] = "召唤魔法车",
		["icon"] = 5003,
		["dic"] = "秒杀最远处的一个敌方英雄。",
		["cd"] = 20,
		["lv_num"] = 2,
		["hero_id"] = "22;28",

	},
	["5"] = {
		["name"] = "召唤烟雾",
		["icon"] = 5004,
		["dic"] = "生成烟雾。降低敌方的命中率。",
		["cd"] = 5,
		["lv_num"] = 2,
		["hero_id"] = "2;16",

	},
	["6"] = {
		["name"] = "召唤飞艇",
		["icon"] = 5005,
		["dic"] = "轰炸距离最远的敌方战车、召唤阵、英雄等。",
		["cd"] = 20,
		["lv_num"] = 2,
		["hero_id"] = "",

	},
	["7"] = {
		["name"] = "绘制召唤阵",
		["icon"] = 5006,
		["dic"] = "绘制出法阵，从里面不断出现增援的喽啰。",
		["cd"] = 10,
		["lv_num"] = 2,
		["hero_id"] = "14;26",

	},
	["8"] = {
		["name"] = "卫星定位",
		["icon"] = 5007,
		["dic"] = "己方全体英雄的命中率增加。",
		["cd"] = 20,
		["lv_num"] = 2,
		["hero_id"] = "8;13",

	},
	["9"] = {
		["name"] = "召唤图腾柱",
		["icon"] = 5008,
		["dic"] = "己方英雄的攻防能力提高，中毒状态的英雄不享受此效果。",
		["cd"] = 15,
		["lv_num"] = 2,
		["hero_id"] = "12;24",

	},
	["10"] = {
		["name"] = "大回血",
		["icon"] = 5009,
		["dic"] = "己方全体英雄，持续恢复一定的血量。",
		["cd"] = 15,
		["lv_num"] = 2,
		["hero_id"] = "10;20",

	},
	["11"] = {
		["name"] = "解毒",
		["icon"] = 5010,
		["dic"] = "为己方的中毒英雄解毒。",
		["cd"] = 5,
		["lv_num"] = 2,
		["hero_id"] = "1;7",

	},
	["12"] = {
		["name"] = "虚弱",
		["icon"] = 5011,
		["dic"] = "对方全体英雄虚弱，持续X秒。虚弱者，受到的伤害加强，增益效果被削弱。",
		["cd"] = 15,
		["lv_num"] = 2,
		["hero_id"] = "4;30",

	},
	["13"] = {
		["name"] = "圣光",
		["icon"] = 5012,
		["dic"] = "处于磁暴、虚弱、中毒状态的成员，解除其效果。",
		["cd"] = 20,
		["lv_num"] = 2,
		["hero_id"] = "6;23",

	},
	["14"] = {
		["name"] = "暴风雪",
		["icon"] = 5013,
		["dic"] = "召唤暴风雪，令全体敌人遭受伤害。",
		["cd"] = 25,
		["lv_num"] = 2,
		["hero_id"] = "17;21",

	},
	["15"] = {
		["name"] = "火雨",
		["icon"] = 5014,
		["dic"] = "召唤暴灼热的陨石，令全体敌人遭受伤害。",
		["cd"] = 25,
		["lv_num"] = 2,
		["hero_id"] = "15;25",

	},
	["16"] = {
		["name"] = "闪电",
		["icon"] = 5015,
		["dic"] = "召唤闪电风暴，令全体敌人遭受伤害。",
		["cd"] = 25,
		["lv_num"] = 2,
		["hero_id"] = "3;27",

	},

}
return juexing_skill
