local define_open_act = {
	["1"] = {
		["name"] = "累计充值",
		["desc"] = "活动期间达到指定条件，可领取奖励",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},
	["2"] = {
		["name"] = "累计充值",
		["desc"] = "活动期间达到指定条件，可领取奖励，邮件发送",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},
	["3"] = {
		["name"] = "累计消费",
		["desc"] = "活动期间达到指定条件，可领取奖励",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},
	["4"] = {
		["name"] = "充值返利",
		["desc"] = "活动期间达到指定条件，可领取奖励，邮件发送",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},
	["5"] = {
		["name"] = "战力排行",
		["desc"] = "活动期间达到指定条件，可领取奖励，邮件发送",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},
	["6"] = {
		["name"] = "竞技场排行",
		["desc"] = "活动期间达到指定条件，可领取奖励",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},
	["7"] = {
		["name"] = "竞技场排行",
		["desc"] = "活动期间达到指定条件，可领取奖励，邮件发送",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},
	["8"] = {
		["name"] = "等级排行",
		["desc"] = "活动期间达到指定条件，可领取奖励",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},
	["9"] = {
		["name"] = "等级排行",
		["desc"] = "活动期间达到指定条件，可领取奖励，邮件发送",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},
	["10"] = {
		["name"] = "最强公会",
		["desc"] = "活动期间达到指定条件，可领取奖励，邮件发送",
		["days"] = 2,
		["end_tm"] = 0.58333333333333,

	},

}
return define_open_act
