local define_random_name = {
	["1"] = {
		["name"] = "奥拉基尔之伤",

	},
	["2"] = {
		["name"] = "蓝龙的热血",

	},
	["3"] = {
		["name"] = "正义盟百夫长",

	},
	["4"] = {
		["name"] = "夜枭持枪军士",

	},
	["5"] = {
		["name"] = "格鲁尔之敌",

	},
	["6"] = {
		["name"] = "刀塔风语者",

	},
	["7"] = {
		["name"] = "永夜港护火者",

	},
	["8"] = {
		["name"] = "猎鹰怒吼祭祀",

	},
	["9"] = {
		["name"] = "夜枭持斧近卫",

	},
	["10"] = {
		["name"] = "控制他们萨满",

	},
	["11"] = {
		["name"] = "瓦斯琪的遗泽",

	},
	["12"] = {
		["name"] = "巨鲸舰队守护",

	},
	["13"] = {
		["name"] = "凯恩之怒",

	},
	["14"] = {
		["name"] = "奥金顿抚风者",

	},
	["15"] = {
		["name"] = "血羽守卫者",

	},
	["16"] = {
		["name"] = "野猪持盾中将",

	},
	["17"] = {
		["name"] = "当个法师挺好",

	},
	["18"] = {
		["name"] = "灵猴持盾中士",

	},
	["19"] = {
		["name"] = "沙怒护火者",

	},
	["20"] = {
		["name"] = "青铜龙的亲睐",

	},
	["21"] = {
		["name"] = "猎鹰怒吼督军",

	},
	["22"] = {
		["name"] = "安戈洛祭祀",

	},
	["23"] = {
		["name"] = "血槌之傲",

	},
	["24"] = {
		["name"] = "做个牧师试试",

	},
	["25"] = {
		["name"] = "索兰莉安之影",

	},
	["26"] = {
		["name"] = "复仇军百夫长",

	},
	["27"] = {
		["name"] = "野猪之守卫",

	},
	["28"] = {
		["name"] = "激流堡防御者",

	},
	["29"] = {
		["name"] = "鬼雾峰神谕者",

	},
	["30"] = {
		["name"] = "孤狼持盾卫士",

	},
	["31"] = {
		["name"] = "弗丁之敌",

	},
	["32"] = {
		["name"] = "猎鹰的护法",

	},
	["33"] = {
		["name"] = "艾萨拉看守者",

	},
	["34"] = {
		["name"] = "银狮统帅",

	},
	["35"] = {
		["name"] = "打断对面萨满",

	},
	["36"] = {
		["name"] = "血羽猎奇者",

	},
	["37"] = {
		["name"] = "阿拉希守卫者",

	},
	["38"] = {
		["name"] = "猛虎之将军",

	},
	["39"] = {
		["name"] = "雄鹰之护法",

	},
	["40"] = {
		["name"] = "当个牧师真难",

	},
	["41"] = {
		["name"] = "银月祭祀",

	},
	["42"] = {
		["name"] = "麦格娜的恶意",

	},
	["43"] = {
		["name"] = "野猪舰队祭祀",

	},
	["44"] = {
		["name"] = "持剑中士",

	},
	["45"] = {
		["name"] = "巨猿舰队统帅",

	},
	["46"] = {
		["name"] = "血环贤者",

	},
	["47"] = {
		["name"] = "血槌贤者",

	},
	["48"] = {
		["name"] = "控制敌方迪凯",

	},
	["49"] = {
		["name"] = "刀塔之杰",

	},
	["50"] = {
		["name"] = "巨鲸喧嚣护法",

	},
	["51"] = {
		["name"] = "凯恩的子嗣",

	},
	["52"] = {
		["name"] = "大漩涡护水者",

	},
	["53"] = {
		["name"] = "火羽山复仇者",

	},
	["54"] = {
		["name"] = "转火对面迪凯",

	},
	["55"] = {
		["name"] = "阿曼尼萃水者",

	},
	["56"] = {
		["name"] = "雄鹰持盾元帅",

	},
	["57"] = {
		["name"] = "孤狼的司令",

	},
	["58"] = {
		["name"] = "雄鹰持盾守卫",

	},
	["59"] = {
		["name"] = "加基森之灵",

	},
	["60"] = {
		["name"] = "暴君的迷离",

	},
	["61"] = {
		["name"] = "杜隆坦碎颅者",

	},
	["62"] = {
		["name"] = "永夜港萃水者",

	},
	["63"] = {
		["name"] = "雄鹰之士官长",

	},
	["64"] = {
		["name"] = "奥金顿震地者",

	},
	["65"] = {
		["name"] = "勇士岛护火者",

	},
	["66"] = {
		["name"] = "野猪持剑侍卫",

	},
	["67"] = {
		["name"] = "野熊的勇士",

	},
	["68"] = {
		["name"] = "弗丁之傲",

	},
	["69"] = {
		["name"] = "灵猴之督军",

	},
	["70"] = {
		["name"] = "战歌氏族之怒",

	},
	["71"] = {
		["name"] = "夜枭持枪督军",

	},
	["72"] = {
		["name"] = "维伦的秘密",

	},
	["73"] = {
		["name"] = "做好术士真难",

	},
	["74"] = {
		["name"] = "诺森德毁灭者",

	},
	["75"] = {
		["name"] = "巨猿持盾督军",

	},
	["76"] = {
		["name"] = "羊住那个术士",

	},
	["77"] = {
		["name"] = "做个猎人真难",

	},
	["78"] = {
		["name"] = "雄鹰咆哮骑士",

	},
	["79"] = {
		["name"] = "孤狼持剑司令",

	},
	["80"] = {
		["name"] = "塞拉摩守卫者",

	},
	["81"] = {
		["name"] = "血顶防御者",

	},
	["82"] = {
		["name"] = "沙怒看守者",

	},
	["83"] = {
		["name"] = "吉安娜的骄傲",

	},
	["84"] = {
		["name"] = "烈焰峰防御者",

	},
	["85"] = {
		["name"] = "猛虎持剑军士",

	},
	["86"] = {
		["name"] = "集火敌方战士",

	},
	["87"] = {
		["name"] = "凤凰骑士",

	},
	["88"] = {
		["name"] = "持杖军士",

	},
	["89"] = {
		["name"] = "火喉护火者",

	},
	["90"] = {
		["name"] = "乌瑞恩的制裁",

	},
	["91"] = {
		["name"] = "索瑞森抚风者",

	},
	["92"] = {
		["name"] = "麦格娜之殇",

	},
	["93"] = {
		["name"] = "穆拉克的果断",

	},
	["94"] = {
		["name"] = "打断对面萨满",

	},
	["95"] = {
		["name"] = "当好牧师试试",

	},
	["96"] = {
		["name"] = "维伦之惑",

	},
	["97"] = {
		["name"] = "持盾军士长",

	},
	["98"] = {
		["name"] = "制裁那个法师",

	},
	["99"] = {
		["name"] = "森金之灵",

	},
	["100"] = {
		["name"] = "深结这个猎人",

	},
	["101"] = {
		["name"] = "羊住敌方战士",

	},
	["102"] = {
		["name"] = "玛维的仆从",

	},
	["103"] = {
		["name"] = "能源舰防御者",

	},
	["104"] = {
		["name"] = "红龙之恨",

	},
	["105"] = {
		["name"] = "库德兰护火者",

	},
	["106"] = {
		["name"] = "做个小德也好",

	},
	["107"] = {
		["name"] = "灵猴喧嚣将军",

	},
	["108"] = {
		["name"] = "羊住这个小德",

	},
	["109"] = {
		["name"] = "伊瑟拉之恨",

	},
	["110"] = {
		["name"] = "正义盟少校",

	},
	["111"] = {
		["name"] = "当好法师挺好",

	},
	["112"] = {
		["name"] = "野猪持剑卫士",

	},
	["113"] = {
		["name"] = "血羽看守者",

	},
	["114"] = {
		["name"] = "弗丁的傲慢",

	},
	["115"] = {
		["name"] = "冬寒守卫者",

	},
	["116"] = {
		["name"] = "回音山贤者",

	},
	["117"] = {
		["name"] = "火羽山护水者",

	},
	["118"] = {
		["name"] = "霜狼护风者",

	},
	["119"] = {
		["name"] = "野猪持杖勇士",

	},
	["120"] = {
		["name"] = "安其拉狂暴者",

	},
	["121"] = {
		["name"] = "黑骑士之敌",

	},
	["122"] = {
		["name"] = "卡拉赞看守者",

	},
	["123"] = {
		["name"] = "永夜港撕裂者",

	},
	["124"] = {
		["name"] = "奥杜尔毁灭者",

	},
	["125"] = {
		["name"] = "激流堡护火者",

	},
	["126"] = {
		["name"] = "祖阿曼贤者",

	},
	["127"] = {
		["name"] = "银鹰司令",

	},
	["128"] = {
		["name"] = "艾格文之魅",

	},
	["129"] = {
		["name"] = "蓝龙的陨落",

	},
	["130"] = {
		["name"] = "银月猎奇者",

	},
	["131"] = {
		["name"] = "晕住他们牧师",

	},
	["132"] = {
		["name"] = "古达克之杰",

	},
	["133"] = {
		["name"] = "巨鲸持斧中士",

	},
	["134"] = {
		["name"] = "猎鹰持杖祭祀",

	},
	["135"] = {
		["name"] = "做个小德试试",

	},
	["136"] = {
		["name"] = "安戈洛毁灭者",

	},
	["137"] = {
		["name"] = "奥拉基尔之伤",

	},
	["138"] = {
		["name"] = "雷电君王之伤",

	},
	["139"] = {
		["name"] = "红龙的恶意",

	},
	["140"] = {
		["name"] = "艾格文的坚毅",

	},
	["141"] = {
		["name"] = "孤狼之军士",

	},
	["142"] = {
		["name"] = "野猪持枪勇士",

	},
	["143"] = {
		["name"] = "伊利丹的骄傲",

	},
	["144"] = {
		["name"] = "阿拉索猎奇者",

	},
	["145"] = {
		["name"] = "沉默这个法师",

	},
	["146"] = {
		["name"] = "丹莫德看守者",

	},
	["147"] = {
		["name"] = "做好盗贼挺好",

	},
	["148"] = {
		["name"] = "双子峰看守者",

	},
	["149"] = {
		["name"] = "德拉诺狂暴者",

	},
	["150"] = {
		["name"] = "晕住敌方武僧",

	},
	["151"] = {
		["name"] = "猎鹰持斧近卫",

	},
	["152"] = {
		["name"] = "霜狼氏族之祸",

	},
	["153"] = {
		["name"] = "马戏团买票者",

	},
	["154"] = {
		["name"] = "暴风城包工头",

	},
	["155"] = {
		["name"] = "狗男女",

	},
	["156"] = {
		["name"] = "正义盟少校",

	},
	["157"] = {
		["name"] = "屠夫的愤怒",

	},
	["158"] = {
		["name"] = "黑铁防御者",

	},
	["159"] = {
		["name"] = "玛利苟斯之影",

	},
	["160"] = {
		["name"] = "夜枭咆哮中将",

	},
	["161"] = {
		["name"] = "迪亚布罗之疑",

	},
	["162"] = {
		["name"] = "森金碎颅者",

	},
	["163"] = {
		["name"] = "冬寒卖萌者",

	},
	["164"] = {
		["name"] = "血羽之杰",

	},
	["165"] = {
		["name"] = "迪菲亚的狡诈",

	},
	["166"] = {
		["name"] = "控制那个术士",

	},
	["167"] = {
		["name"] = "鬼雾峰猎颅者",

	},
	["168"] = {
		["name"] = "米尔豪斯之伤",

	},
	["169"] = {
		["name"] = "外域开荒者",

	},
	["170"] = {
		["name"] = "穆拉克的迷离",

	},
	["171"] = {
		["name"] = "晕住那个萨满",

	},
	["172"] = {
		["name"] = "死亡矿井之王",

	},
	["173"] = {
		["name"] = "冰风岗萃水者",

	},
	["174"] = {
		["name"] = "冬泉谷护风者",

	},
	["175"] = {
		["name"] = "库德兰守卫者",

	},
	["176"] = {
		["name"] = "麦迪文之魅",

	},
	["177"] = {
		["name"] = "丹莫德复仇者",

	},
	["178"] = {
		["name"] = "月神殿复仇者",

	},
	["179"] = {
		["name"] = "铁炉堡守卫",

	},
	["180"] = {
		["name"] = "夜枭的督军",

	},
	["181"] = {
		["name"] = "阿拉希预言者",

	},
	["182"] = {
		["name"] = "祖达克猎颅者",

	},
	["183"] = {
		["name"] = "海加尔复仇者",

	},
	["184"] = {
		["name"] = "冬泉谷护风者",

	},
	["185"] = {
		["name"] = "莫高雷守护者",

	},
	["186"] = {
		["name"] = "石爪山防御者",

	},
	["187"] = {
		["name"] = "荆棘谷勇士",

	},
	["188"] = {
		["name"] = "赤脊山挖矿者",

	},
	["189"] = {
		["name"] = "黑海岸守卫",

	},
	["190"] = {
		["name"] = "灰谷复仇者",

	},
	["191"] = {
		["name"] = "湿地守卫者",

	},

}
return define_random_name
